import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

Rename column names using function. "First Name" --> "first_name", "Age" --> "age
Print the first 3 rows of the DataFrame
Find the mean age of the individuals
Select and print only the 'Name' and 'City' columns
Add a new column 'Salary' with random salary values
Display summary statistics of the DataFrame
Homework 2:

Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.
Month	Sales	Expenses
Jan	5000	3000
Feb	6000	3500
Mar	7500	4000
Apr	8000	4500
Calculate and display the maximum sales and expenses.
Calculate and display the minimum sales and expenses.
Calculate and display the average sales and expenses.
Homework 3:

Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.
Category	January	February	March	April
Rent	1200	1300	1400	1500
Utilities	200	220	240	250
Groceries	300	320	330	350
Entertainment	150	160	170	180
Calculate and display the maximum expense for each category.
Calculate and display the minimum expense for each category.
Calculate and display the average expense for each category.
In this task, use .set_index method to make Category column as index.

Try this code, learn it and use it in the task.

expenses.set_index('Category')

In [1]:
import pandas as pd

In [3]:
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [6]:
df_renamed = df.rename(columns = {"First Name": "first_name", "Age": "age"})
df_renamed

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [7]:
df_renamed.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [11]:
mean_age = df_renamed['age'].mean()
print(f"Mean of age individuals {mean_age} years")

Mean of age individuals 32.5 years

In [15]:
two_column = df_renamed[['first_name', 'City']]
two_column

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [16]:
import numpy as np

In [17]:
df_renamed['Salary'] = np.random.randint(100, 500, size = len(df_renamed))
df_renamed

  first_name  age           City  Salary
0      Alice   25       New York     138
1        Bob   30  San Francisco     230
2    Charlie   35    Los Angeles     371
3      David   40        Chicago     282

In [19]:
df_renamed.describe()

             age      Salary
count   4.000000    4.000000
mean   32.500000  255.250000
std     6.454972   97.465806
min    25.000000  138.000000
25%    28.750000  207.000000
50%    32.500000  256.000000
75%    36.250000  304.250000
max    40.000000  371.000000

In [20]:
data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}

df1 = pd.DataFrame(data)
df1

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [23]:
max_values = df1[['Sales', 'Expenses']].max()

print(max_values)

Sales       8000
Expenses    4500
dtype: int64

In [24]:
min_values = df1[['Sales', 'Expenses']].min()

print(min_values)

Sales       5000
Expenses    3000
dtype: int64

In [25]:
avg_values = df1[['Sales', 'Expenses']].mean()

print(avg_values)

Sales       6625.0
Expenses    3750.0
dtype: float64

In [37]:
import pandas as pd

# 1. Создание DataFrame под названием 'expenses'
# Мы создаем словарь, где ключи - это названия колонок, а значения - списки данных для этих колонок.
data = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February': [1300, 220, 320, 160],
    'March': [1400, 240, 330, 170],
    'April': [1500, 250, 350, 180]
}

# Используем этот словарь для создания DataFrame.
expenses = pd.DataFrame(data)

print("Исходный DataFrame 'expenses':")
print(expenses)
print("-" * 50)

# 2. Использование метода .set_index() для установки 'Category' в качестве индекса
# Мы создаем новый DataFrame 'expenses_indexed', где 'Category' теперь является индексом.
# Оригинальный 'expenses' остается без изменений, если мы не используем inplace=True.
expenses_indexed = expenses.set_index('Category')

print("\nDataFrame 'expenses' с 'Category' в качестве индекса:")
print(expenses_indexed)
print("-" * 50)

# 3. Расчет и отображение максимальных расходов для каждой категории
# Метод .max(axis=1) вычисляет максимальное значение для каждой строки (то есть для каждой категории).
max_expense = expenses_indexed.max(axis=1)
print("\nМаксимальные расходы по каждой категории:")
print(max_expense)
print("-" * 50)

# 4. Расчет и отображение минимальных расходов для каждой категории
# Метод .min(axis=1) вычисляет минимальное значение для каждой строки.
min_expense = expenses_indexed.min(axis=1)
print("\nМинимальные расходы по каждой категории:")
print(min_expense)
print("-" * 50)

# 5. Расчет и отображение средних расходов для каждой категории
# Метод .mean(axis=1) вычисляет среднее значение для каждой строки.
average_expense = expenses_indexed.mean(axis=1)
print("\nСредние расходы по каждой категории:")
print(average_expense)
print("-" * 50)

Исходный DataFrame 'expenses':
        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180
--------------------------------------------------

DataFrame 'expenses' с 'Category' в качестве индекса:
               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180
--------------------------------------------------

Максимальные расходы по каждой категории:
Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64
--------------------------------------------------

Минимальные расходы по каждой категории:
Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64
--------------------------------------------------

Средние расходы по каждой категории:
Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64
--------------------------------------------------